Revit 2027 API
FabricationConfiguration.GetAirturnName Method
 Gets the airturn name from its database identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetAirturnName(
	int airturnId
)
Public Function GetAirturnName (
	airturnId As Integer
) As String
public:
String^ GetAirturnName(
	int airturnId
)
member GetAirturnName :
        airturnId : int -> string
Parameters
airturnId Int32
 The air turn database identifier.
Return Value
String
 The air turn name.
Exceptions
Exception | Condition
ArgumentException |  The air turn does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace